tap "homebrew/bundle"
brew "c-ares"
brew "python-argcomplete"
brew "python-typing-extensions"
brew "sqlite"
brew "xz"
brew "pyyaml"
brew "commitizen"
brew "gh"
brew "git"
brew "glib"
brew "unbound"
brew "libssh"
brew "libuv"
brew "node"
brew "zstd"
brew "qemu"
brew "podman"
brew "python@3.11"
cask "alt-tab"
cask "balenaetcher"
cask "bitwarden"
cask "cakebrew"
cask "devtoys"
cask "fig"
cask "mark-text"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "monitorcontrol"
cask "notunes"
cask "numi"
cask "shottr"
cask "slack"
cask "stats"
cask "hoppscotch"
