tap "homebrew/bundle"
tap "localsend/localsend"
brew "xz"
brew "zstd"
brew "libtiff"
brew "jpeg-xl"
brew "c-ares"
brew "icu4c@76"
brew "libuv"
brew "openssl@3"
brew "node"
brew "bitwarden-cli"
brew "gettext"
brew "sqlite"
brew "glib"
brew "duti"
brew "gh"
brew "git"
brew "unbound"
brew "gnutls"
brew "netpbm"
brew "harfbuzz"
brew "graphviz"
brew "httpie"
brew "libssh"
brew "python-argcomplete"
brew "python-markupsafe"
brew "pyyaml"
brew "qemu"
cask "alt-tab"
cask "balenaetcher"
cask "bitwarden"
cask "bruno"
cask "cakebrew"
cask "fig"
cask "latest"
cask "localsend"
cask "mark-text"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "monitorcontrol"
cask "notunes"
cask "numi"
cask "shottr"
cask "stats"
cask "warp"
cask "yaak"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "continue.continue"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "editorconfig.editorconfig"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot-workspace"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.vscode-drawio"
vscode "idered.npm"
vscode "maxvanderschee.web-accessibility"
vscode "meganrogge.template-string-converter"
vscode "miguelsolorio.fluent-icons"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "mylesmurphy.prettify-ts"
vscode "nicoespeon.abracadabra"
vscode "orta.vscode-jest"
vscode "philnash.ngrok-for-vscode"
vscode "pwabuilder.pwa-studio"
vscode "quicktype.quicktype"
vscode "ritwickdey.liveserver"
vscode "saoudrizwan.claude-dev"
vscode "sburg.vscode-javascript-booster"
vscode "sleistner.vscode-fileutils"
vscode "sonarsource.sonarlint-vscode"
vscode "stevencl.adddoccomments"
vscode "stylelint.vscode-stylelint"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "wayou.vscode-todo-highlight"
vscode "withfig.fig"
vscode "wmaurer.change-case"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
