tap "espanso/espanso"
tap "homebrew/bundle"
tap "homebrew/services"
tap "localsend/localsend"
# Run your GitHub Actions locally
brew "act"
# General-purpose data compression with high compression ratio
brew "xz"
# Zstandard is a real-time compression algorithm
brew "zstd"
# TIFF library and utilities
brew "libtiff"
# New file format for still image compression
brew "jpeg-xl"
# Asynchronous DNS library
brew "c-ares"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Core application library for C
brew "glib"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Image manipulation
brew "netpbm"
# OpenType text shaping engine
brew "harfbuzz"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Python version management
brew "pyenv"
# Tab completion for Python argparse
brew "python-argcomplete"
# Generic machine emulator and virtualizer
brew "qemu"
# Persistent key-value database, with built-in net interface
brew "redis"
# JavaScript package manager
brew "yarn"
# Enable Windows-like alt-tab
cask "alt-tab"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Desktop password and login vault
cask "bitwarden"
# Cross-platform Text Expander written in Rust
cask "espanso"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Testing client for REST, GraphQL, and HTTP APIs
cask "httpie-desktop"
# Utility that shows the latest app updates
cask "latest"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Markdown editor
cask "mark-text"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Calendar for professionals and teams
cask "notion-calendar"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Calculator and converter application
cask "numi"
# Replacement for Docker Desktop
cask "orbstack"
# WebKit based web browser
cask "orion"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Screenshot measurement and annotation tool
cask "shottr"
# System monitor for the menu bar
cask "stats"
# REST, GraphQL and gRPC client
cask "yaak"
