tap "homebrew/bundle"
tap "espanso/espanso"
tap "localsend/localsend"
# Run your GitHub Actions locally
brew "act"
# TIFF library and utilities
brew "libtiff"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# New file format for still image compression
brew "jpeg-xl"
# Core application library for C
brew "glib"
# Asynchronous DNS library
brew "c-ares"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# GNU compiler collection
brew "gcc"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Image manipulation
brew "netpbm"
# OpenType text shaping engine
brew "harfbuzz"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Python version management
brew "pyenv"
# Tab completion for Python argparse
brew "python-argcomplete"
# Generic machine emulator and virtualizer
brew "qemu"
# JavaScript package manager
brew "yarn"
