tap "espanso/espanso"
tap "homebrew/bundle"
tap "localsend/localsend"
brew "xz"
brew "zstd"
brew "libtiff"
brew "jpeg-xl"
brew "c-ares"
brew "icu4c@76"
brew "libuv"
brew "openssl@3"
brew "gettext"
brew "glib"
brew "sqlite"
brew "gh"
brew "git"
brew "unbound"
brew "gnutls"
brew "netpbm"
brew "harfbuzz"
brew "python@3.13"
brew "graphviz"
brew "httpie"
brew "libssh"
brew "pipx"
brew "pyenv"
brew "python-argcomplete"
brew "qemu"
brew "yarn"
cask "balenaetcher"
cask "espanso"
cask "ghostty"
cask "latest"
cask "localsend"
cask "mark-text"
cask "yaak"
